<html lang="en">
<head>
<title>Distrib - Manual do Geomview</title>
<meta http-equiv="Content-Type" content="text/html">
<meta name="description" content="Manual do Geomview">
<meta name="generator" content="makeinfo 4.13">
<link title="Top" rel="start" href="index.html#Top">
<link rel="prev" href="Intro.html#Intro" title="Intro">
<link rel="next" href="Copiando.html#Copiando" title="Copiando">
<link href="http://www.gnu.org/software/texinfo/" rel="generator-home" title="Texinfo Homepage">
<meta http-equiv="Content-Style-Type" content="text/css">
<style type="text/css"><!--
  pre.display { font-family:inherit }
  pre.format  { font-family:inherit }
  pre.smalldisplay { font-family:inherit; font-size:smaller }
  pre.smallformat  { font-family:inherit; font-size:smaller }
  pre.smallexample { font-size:smaller }
  pre.smalllisp    { font-size:smaller }
  span.sc    { font-variant:small-caps }
  span.roman { font-family:serif; font-weight:normal; } 
  span.sansserif { font-family:sans-serif; font-weight:normal; } 
--></style>
</head>
<body>
<div class="node">
<a name="Distrib"></a>
<p>
Next:&nbsp;<a rel="next" accesskey="n" href="Copiando.html#Copiando">Copiando</a>,
Previous:&nbsp;<a rel="previous" accesskey="p" href="Intro.html#Intro">Intro</a>,
Up:&nbsp;<a rel="up" accesskey="u" href="index.html#Top">Top</a>
<hr>
</div>

<h2 class="unnumbered">Distribui&ccedil;&atilde;o</h2>

<p>Geomview &eacute; um <dfn>software</dfn> livre; isso significa que qualquer um &eacute; livre para
us&aacute;-lo e livre para redistribu&iacute;-lo sob certas condi&ccedil;&otilde;es. 
Geomview n&atilde;o &eacute;
de dom&iacute;nio p&uacute;blico; &eacute; protegido por direitos autorais e existem restri&ccedil;&otilde;es
sobre sua distribui&ccedil;&atilde;o, mas essas restri&ccedil;&otilde;es s&atilde;o montadas de forma a permitir
qualquer coisa que um bom cidad&atilde;o colaborador possa querer fazer.  O que n&atilde;o &eacute;
permitido &eacute; para tentar previnir outros de compartilhamento adicional de qualquer vers&atilde;o
do Geomview que eles possam pegar de voc&ecirc;.  As condi&ccedil;&otilde;es precisas podem ser
encontradas na Licen&ccedil;a Geral Menor do GNU que acompanha o Geomview e tamb&eacute;m
aparece acompanhando essa se&ccedil;&atilde;o.

   <p>Uma forma de acessar uma c&oacute;pia do Geomview &eacute; a partir de algu&eacute;m que j&aacute; possua o Geomview.  Voc&ecirc;
n&atilde;o precisa perguntar por nossa permiss&atilde;o para fazer isso, ou informar qualquer coisa; apenas
fa&ccedil;a a c&oacute;pia.  Se voc&ecirc; tiver acesso &agrave; internet, voc&ecirc; pode pegar a mais recente
vers&atilde;o do Geomview em <a href="http://www.geomview.org">http://www.geomview.org</a>.

   <p>Voc&ecirc; tamb&eacute;m pode receber Geomview quando voc&ecirc; compra um computador.  Fabricantes de
computadores est&atilde;o livres para distribuir c&oacute;pias sob os mesmos termos que s&atilde;o aplicados a
qualquer pessoa.  Esses termos requerem que os fabricantes forne&ccedil;am a voc&ecirc; o c&oacute;digo completo,
incluindo qualquer mudan&ccedil;as que eles tenham feito, e permitam a voc&ecirc; que
redistribua o Geomview recebido deles nos termos usuais da
Licen&ccedil;a P&uacute;blica Geral Menor do GNU.  Em outras palavras, o programa deve ser livre para voc&ecirc;
quando voc&ecirc; o receber, n&atilde;o apenas livre para o fabricante.

   </body></html>

