<html lang="en">
<head>
<title>Historia - Manual do Geomview</title>
<meta http-equiv="Content-Type" content="text/html">
<meta name="description" content="Manual do Geomview">
<meta name="generator" content="makeinfo 4.13">
<link title="Top" rel="start" href="index.html#Top">
<link rel="prev" href="Copiando.html#Copiando" title="Copiando">
<link rel="next" href="Plantaformas.html#Plantaformas" title="Plantaformas">
<link href="http://www.gnu.org/software/texinfo/" rel="generator-home" title="Texinfo Homepage">
<meta http-equiv="Content-Style-Type" content="text/css">
<style type="text/css"><!--
  pre.display { font-family:inherit }
  pre.format  { font-family:inherit }
  pre.smalldisplay { font-family:inherit; font-size:smaller }
  pre.smallformat  { font-family:inherit; font-size:smaller }
  pre.smallexample { font-size:smaller }
  pre.smalllisp    { font-size:smaller }
  span.sc    { font-variant:small-caps }
  span.roman { font-family:serif; font-weight:normal; } 
  span.sansserif { font-family:sans-serif; font-weight:normal; } 
--></style>
</head>
<body>
<div class="node">
<a name="Historia"></a>
<p>
Next:&nbsp;<a rel="next" accesskey="n" href="Plantaformas.html#Plantaformas">Plantaformas</a>,
Previous:&nbsp;<a rel="previous" accesskey="p" href="Copiando.html#Copiando">Copiando</a>,
Up:&nbsp;<a rel="up" accesskey="u" href="index.html#Top">Top</a>
<hr>
</div>

<h2 class="unnumbered">Hist&oacute;ria do Desenvolvimento do Geomview</h2>

<p>Geomview foi originalmente escrito no Geometry Center da the University
of Minnesota in Minneapolis. 
O Geometry Center era um centro de pesquisa e educa&ccedil;&atilde;o
fundado pela National Science Foundation, com a miss&atilde;o de promover
pesquisa e comunica&ccedil;&atilde;o de assuntos relacionados &agrave; matem&aacute;tica.  A maioria do trabalho era
direcionado ao uso de computadores para ajudar a visualiza&ccedil;&atilde;o de conceitos matem&aacute;ticos.

   <p>O projeto que eventualmente levou ao Geomview
come&ccedil;ou no ver&atilde;o de 1988 com o trabalho de Pat
Hanrahan sobre um programa de visualiza&ccedil;&atilde;o chamado MinneView.  Pouco tempo
depois Charlie Gunn come&ccedil;ou o desenvolvimento da OOGL
(Object Oriented Graphics Language) juntamente com o
MinneView.  Muitas pessoas comtribuiram para a OOGL e o MinneView,
incluindo Stuart Levy, Mark Meuer, Tamara Munzner, Steve
Anderson, Mario Lopez, Todd Kaplan.

   <p>Em 1991 o staff do Geometry Center come&ccedil;ou o trabalho sobre uma nova e melhorada
vers&atilde;o da OOGL, e um novo e melhorado programa de visualiza&ccedil;&atilde;o, o qual eles
chamaram Geomview.  Naquele tempo essencialmente o &uacute;nico jogo no comercio para
gr&aacute;ficos interativos em tr&ecirc;s dimens&otilde;es era Silicon Graphics (SGI), de forma que Geomview foi
desenvolvido inicialmente em esta&ccedil;&otilde;es de trabalho SGI, usando a IRIS GL.  A primeira
vers&atilde;o foi finalizada em Janeiro de 1992.  Essa primeira vers&atilde;o tornou-se muito
popular entre visitantes do Geometry Center, e atrav&eacute;s do ftp do
Centro (isso ocorreu antes do advento da web) pessoas em outras institui&ccedil;&otilde;es come&ccedil;aram
a usar essa primeira vers&atilde;o tamb&eacute;m.

   <p>Adicionalmente a esta&ccedil;&otilde;es de trabalho SGI o Geometry Center tinha
algumas poucas esta&ccedil;&otilde;es NeXT completas, de forma que ap&oacute;s Geomview estar sendo executado
em m&aacute;quinas SGIs a equipe desenvolveu uma vers&atilde;o para NeXTStep tamb&eacute;m. 
Nessa &eacute;poca ouveram muitos milhares de pessoas usando Geomview
ao redor do mundo.

   <p>Alguns anos depois a equipe portou Geomview para o X windows e a OpenGL, e
eventualmente, com o desaparecimento da NeXT, a vers&atilde;o para NeXT seguiu o mesmo
caminho.

   <p>Nessa miss&atilde;o de incentivar a comunica&ccedil;&atilde;o entre pesquisadores e educadores,
o Geometry Center desenvolveu um web site, www.geom.umn.edu, mais tarde
em 1993.  Esse foi um dos primeiros 300 s&iacute;tios na web que existiram no mundo.  Uma parte desse
s&iacute;tio web era certamente devotado ao Geomview, e ajudou a propagar o
trabalho durante sua exist&ecirc;ncia.

   <p>O Geometry Center fechou suas instala&ccedil;&otilde;es de "tijolos e cimento" em Agosto
de 1998 (NSF cortou suas verbas), mas o s&iacute;tio web continuou a existir, e o
Geomview continuou a ser popular ao redor do mundo.  Em Dezembro de
1999 algum membro da equipe original do Geometry Center configurou
<a href="http://www.geomview.org">http://www.geomview.org</a> como casa permanente na web para o
Geomview.

   <p>Os autores originais do Geomview, bem como v&aacute;rios outros volun&aacute;rios
ao redor do mundo, est&atilde;o ainda ativamente envolvidos na utiliza&ccedil;&atilde;o e no desenvolvimento do
Geomview.

<ul class="menu">
<li><a accesskey="1" href="Autores.html#Autores">Autores</a>:                      Autores. 
</ul>

   </body></html>

